architectures/diagrams/serveIndexHtml.mmd
sequenceDiagram
  participant browser as Browser
  participant route53 as AWS Route 53
  participant hcf as hollowverse.com CloudFront

  browser ->> route53: Request IP address of hollowverse.com
  route53 ->> browser: Return IP address
  browser ->> hcf: Request index.html
  hcf ->> browser: Return index.html
